examples_3D_Simulations/1_3D_RM6_noPTO/constant/waveInput.txt
waveHeights
1
...
wavePeriods
1
...
wavePhases
1
...
waveAngles
1
...
waveDirs
1
...
