examples_3D_Simulations/1_3D_RM6_noPTO/system/waveProbes
// Wave probe locations - Assume tank starts at zero.

    waveProbes
    {
        // Mandatory entries (unmodifiable)
            type            interfaceHeight;
            libs            (fieldFunctionObjects);

        // Mandatory entries (runtime modifiable)
        locations   (
             ( $Probe1 0.0 -1.0)
             ( $Probe2 0.0 -1.0)
             ( $Probe3 0.0 -1.0)
             ( $Probe4 0.0 -1.0)
             ( $Probe5 0.0 -1.0)
        );

        // Optional entries (runtime modifiable)
        alpha       alpha.water;
        liquid      true;
        direction   (0 0 1);
        interpolationScheme cellPoint;
        writeControl    adjustable;
        writeInterval   $writeElev;
    }

